#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
aloxaf/fzf-tab  # Remove if you don't use fzf

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
belak/zsh-utils path:editor

# History
belak/zsh-utils path:history

# Utilities
belak/zsh-utils path:utility
ohmyzsh/ohmyzsh path:plugins/extract

# Other
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions

# Vi mode
jeffreytse/zsh-vi-mode
