tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Fonts
cask "font-maple-mono-nf"

# Terminal & shell
cask "ghostty"
brew "starship"
brew "tmux"
brew "mise"

# Window manager
cask "nikitabobko/tap/aerospace"
brew "FelixKratz/formulae/borders"

# Apps
cask "mac-mouse-fix"
cask "slack"
cask "discord"
cask "tidal"

# CLI tools
brew "git"
brew "gh"
brew "lazygit"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "cmake"
brew "wget"
brew "luarocks"
brew "prettier"

# GPG
brew "gnupg"
brew "pinentry-mac"
